app/views/listings/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---

<p><%= @listing.user.firstname %> <%=@listing.user.lastname%></p>