app/views/listings/show.html.erb

              <div class="content">
                <p><%= @listing.user.firstname %> <%=@listing.user.lastname%></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]