app/controllers/listings_controller.rb

INSERT INTO "listings" ("name", "breed", "price", "documentation", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id
    if(@listing.save)

UPDATE "listings" SET "documentation" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["documentation", "Microchipped, Vaccinated, Desexed"], ["updated_at", "2020-03-10 07:09:54.942892"], ["id", 1]]
---
  def update
    if(@listing.update(listing_params))

DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]
---
  def destroy
    @listing.delete

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_listing
    @listing = Listing.find(params[:id])